# SetSegPt2

## Description
Procedure SetSegPt2 sets the location of the end point of the referenced line or wall object. &lt;BR&gt;
&lt;BR&gt;

```pascal
PROCEDURE SetSegPt2(
				h : HANDLE;
				p : REAL);
```

```python

def vs.SetSegPt2(h, p):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|h|HANDLE|Handle to arc.|
|p|REAL|New end point of line.|

## See Also
VS Functions:
SetSegPt1

## Version
Availability: from MiniCAD
## Category
* Objects - 2D